[
    {
        "title": "Crispy Quinoa Kale and Apple Salad with Chili Oil",
        "url": "https://ohsnapmacros.com/kale-and-quinoa-salad/",
        "ingredients": [
            "▢ 1 cup cooked and cooled quinoa",
            "▢ 2 Tbsp.  chili oil  *",
            "▢ 1/2 tsp.  salt",
            "▢ 1/2 tsp. ground cinnamon",
            "▢ 8  cups roughly chopped kale ribs removed",
            "▢ 1 Tbsp.  extra virgin olive oil",
            "▢ 1/2 tsp. salt",
            "▢ 1/4 tsp. black pepper",
            "▢ 1 avocado  peeled and sliced thin",
            "▢ 1 small shallot thily sliced",
            "▢ 1 small apple thinly sliced",
            "▢ 1/4 cup dried cranberries",
            "▢ 1/4 cup pepitas pumpkin seeds",
            "▢ 3 Tbsp.  feta cheese, crumbled",
            "▢ 2 Tbsp. extra virgin olive oil",
            "▢ 1 Tbsp. balsamic glaze **",
            "▢ 1 lemon, juiced",
            "▢ 1/4 tsp. salt",
            "▢ 1/8 tsp. black pepper"
        ],
        "instructions": [
            "Preheat the oven to 400 degrees Fahrenheit. Line two rimmed baking sheets with parchment paper.",
            "Spread the quinoa on the first baking sheet and toss with 2 tablespoons chili oil, 1/2 teaspoon salt, and 1/8 teaspoon ground cinnamon. Roast in the preheated oven for 15 minutes. Stir and shake the pan, then return to the oven for another 5 to 10 minutes, until golden brown. Set aside to cool.",
            "Toss the kale leaves with 1 tbsp. olive oil, 1/2 teaspoon salt, and 1/4 teaspoon black pepper. Transfer to the second baking sheet and arrange in a single layer. Add to the oven when the quinoa is nearly done and roast for 8 to 10 minutes, stirring once, until softened and crisped.***",
            "Prepare the salad dressing by whisking all the ingredients together until emulsified.",
            "Assemble the salad by transferring the kale to a large serving bowl and topping it with avocado, shallot, apple, cranberries, pepitas, and feta. Drizzle the dressing over the salad and top with the crispy quinoa. Mix and serve immediately."
        ],
        "nutrition": {
            "calories": "Calories: 327kcal",
            "protein": "Protein: 6g",
            "carbohydrates": "Carbohydrates: 26g",
            "fat": "Fat: 24g",
            "SaturatedFat": "Fat: 24g",
            "Cholesterol": "Cholesterol: 5mg",
            "Sodium": "Sodium: 110mg",
            "Potassium": "Potassium: 460mg",
            "Sugar": "Sugar: 11g"
        }
    },
    {
        "title": "Sweet Heat Whipped Feta Dip with Cottage Cheese",
        "url": "https://ohsnapmacros.com/whipped-feta-dip/",
        "ingredients": [
            "▢ 8 oz. feta cheese, block or crumbled  full fat",
            "▢ 1/3 cup low fat cottage cheese (drain excess water, if needed) 88g",
            "▢ 2 Tbsp. lemon juice",
            "▢ 2 Tbsp. olive oil",
            "▢ 1/4 tsp. sea salt",
            "▢ 1/4 tsp. black pepper",
            "▢ 1 Tbsp.  milk  any milk works!",
            "▢ 4 Tbsp. hot honey",
            "▢ 1 Tbsp. chopped chives",
            "▢ 1/4 tsp. crushed red pepper flakes",
            "▢ 1/4 tsp. black pepper",
            "▢ 1/4 tsp. black sesame seeds"
        ],
        "instructions": [
            "Add the feta, cottage cheese, lemon juice, olive oil, sea salt and black pepper to a food processor. Blend for 5 minutes until fully combined and smooth. Add the milk and blend again for another 3-5 minutes. This will help get that final smooth whip we want.",
            "Pour feta mixture into a serving dish.",
            "Drizzle the hot honey over the whipped feta and sprinkle the chives, red pepper flakes, sesame seeds and black pepper on top."
        ],
        "nutrition": {
            "calories": "Calories: 146kcal",
            "protein": "Protein: 7g",
            "carbohydrates": "Carbohydrates: 11g",
            "fat": "Fat: 8g",
            "SaturatedFat": "Fat: 8g",
            "Cholesterol": "Cholesterol: 15mg",
            "Sodium": "Sodium: 341mg",
            "Potassium": "Potassium: 6mg",
            "Sugar": "Sugar: 8g"
        }
    },
    {
        "title": "High-Protein Marry Me Chicken Pasta (58g of protein)",
        "url": "https://ohsnapmacros.com/marry-me-chicken-pasta/",
        "ingredients": [
            "▢ 10 oz. Banza chickpea pasta shells",
            "▢ 1 1/2 lbs. boneless skinless chicken breasts, cubed",
            "▢ 1/2 Tbsp. Italian seasoning",
            "▢ 1 tsp. salt",
            "▢ fresh cracked pepper",
            "▢ 1 Tbsp. oil from sun-dried tomatoes",
            "▢ 2 cups low-fat cottage cheese",
            "▢ 3/4 cup low-sodium chicken broth",
            "▢ 1 tsp. garlic powder",
            "▢ 1 Tbsp. oil from sun-dried tomatoes",
            "▢ 1/2 cup parmesan cheese, shredded 56g",
            "▢ 1/2 cup sun-dried tomatoes  85g",
            "▢ 1 tsp. Italian seasoning",
            "▢ 1/2 tsp. salt",
            "▢ fresh cracked pepper",
            "▢ 1 1/2 cups spinach, packed"
        ],
        "instructions": [
            "Bring a pot of water to a boil and add the pasta shells, cook according to the package instructions. If using chickpea pasta, I like to undercook it by a minute so it doesn’t get mushy.",
            "Add the chicken, Italian seasoning, salt and pepper to a large mixing bowl. Mix to evenly coat the chicken.",
            "In a large pan over medium heat, add the oil from the sundried tomatoes. Once hot, add the chicken and cook on each side untouched for 3-4 minutes or until cooked through and no longer pink.",
            "While the chicken cooks, add the cottage cheese, broth, garlic powder and oil from the sundried tomatoes in a high speed blender and blend until smooth and the cottage cheese is no longer chunky or chalky, approximately 4-5 minutes.",
            "Add the cooked and drained pasta to the pan with the chicken, the blended cottage cheese sauce, parmesan cheese, sundried tomatoes, Italian seasoning, salt, and pepper. Stir to melt the cheese and heat the sauce over medium to medium low heat to avoid clumping.",
            "Add the spinach and stir to wilt. Serve topped with freshly chopped basil, parmesan cheese and adjust with salt and pepper, as needed."
        ],
        "nutrition": {
            "calories": "Calories: 539kcal",
            "protein": "Protein: 58g",
            "carbohydrates": "Carbohydrates: 43g",
            "fat": "Fat: 18g",
            "SaturatedFat": "Fat: 18g",
            "Cholesterol": "Cholesterol: 118mg",
            "Sodium": "Sodium: 1192mg",
            "Potassium": "Potassium: 1147mg",
            "Sugar": "Sugar: 4g"
        }
    },
    {
        "title": "Low Fat Garlic Tomato Pasta Sauce",
        "url": "https://ohsnapmacros.com/garlic-tomato-pasta-sauce/",
        "ingredients": [
            "▢ 1 tsp. olive oil",
            "▢ 4 Tbsp. garlic minced",
            "▢ 1 small yellow onion finely chopped",
            "▢ 1 tsp. basil",
            "▢ 1 tsp. oregano",
            "▢ 1 tsp. salt",
            "▢ fresh cracked black pepper",
            "▢ 30 oz. tomato sauce (two 15 oz. cans)",
            "▢ 6 oz. tomato paste",
            "▢ 1/4 cup beef broth",
            "▢ 3 Tbsp. coconut aminos or soy sauce",
            "▢ 2 Tbsp. honey"
        ],
        "instructions": [
            "Add the olive oil to a large soup pot or Dutch oven over medium-high heat. Add garlic and onion and cook, stirring until fragrant and translucent.",
            "Add the basil, oregano, salt and pepper to the garlic and onions and stir to coat. Pour in the tomato sauce, tomato paste, beef broth, coconut aminos and honey and stir to combine. Bring to a boil and right when it starts popping, lower to a LOW simmer. Simmer for 1 hour, stirring occasionally.",
            "Serve with your favorite pasta noodles or package up and freeze for later."
        ],
        "nutrition": {
            "calories": "Calories: 93kcal",
            "protein": "Protein: 3g",
            "carbohydrates": "Carbohydrates: 17g",
            "fat": "Fat: 2g",
            "SaturatedFat": "Fat: 2g",
            "Cholesterol": "N/A",
            "Sodium": "Sodium: 1106mg",
            "Potassium": "Potassium: 292mg",
            "Sugar": "Sugar: 11g"
        }
    },
    {
        "title": "Rocket Fennel and Pear Salad",
        "url": "https://ohsnapmacros.com/rocket-pear-salad/",
        "ingredients": [
            "▢ 6 cups spring mix with arugula (rocket salad)",
            "▢ 1 medium ripe pear",
            "▢ 1 shallot, thinly sliced",
            "▢ 1/3 cup feta cheese, crumbled",
            "▢ 1/3 cup walnuts, chopped",
            "▢ 1 fennel bulb, thinly sliced",
            "▢ 1/3 cup olive oil",
            "▢ 1/4 cup apple cider vinegar",
            "▢ 1 tsp. dijon mustard",
            "▢ 1 Tbsp. honey",
            "▢ 1/4 tsp. sea salt",
            "▢ 1/4 tsp. black pepper"
        ],
        "instructions": [
            "To prepare the dressing, add all dressing ingredients (olive oil, apple cider vinegar, dijon mustard, honey, sea salt, black pepper) to a small jar. Secure lid onto the jar and shake well until all of the ingredients are combined. Set aside.",
            "Thinly slice pears, set aside. Add mixed greens to a large serving dish. Add pears, shallots, feta cheese, walnuts and fennel on top.",
            "Generously pour dressing over the top of the salad. Gently toss salad ingredients with the dressing until everything is evenly coated. Serve immediately."
        ],
        "nutrition": {
            "calories": "Calories: 299kcal",
            "protein": "Protein: 6g",
            "carbohydrates": "Carbohydrates: 21g",
            "fat": "Fat: 22g",
            "SaturatedFat": "Fat: 22g",
            "Cholesterol": "Cholesterol: 9mg",
            "Sodium": "Sodium: 202mg",
            "Potassium": "Potassium: 350mg",
            "Sugar": "Sugar: 12g"
        }
    },
    {
        "title": "Air Fryer Bacon Wrapped Filet Mignon with Gorgonzola Cheese",
        "url": "https://ohsnapmacros.com/air-fryer-filet-mignon/",
        "ingredients": [
            "▢ 1.5 lbs. beef tenderloin steaks (filet mignon) 1 1/2 to 2 inch thick",
            "▢ 4 slices thick cut bacon",
            "▢ kosher salt",
            "▢ black pepper",
            "▢ 2 oz. gorgonzola or blue cheese crumbles"
        ],
        "instructions": [
            "Set the filet out for at least 30 minutes before cooking. Cut the tenderloin into four 6 oz. filets and season all sides well with kosher salt and fresh cracked black pepper (optional), you can also do 4 oz. filets.",
            "Preheat the air fryer to 400 degrees Fahrenheit. Take one piece of bacon per filet and wrap it around the top and bottom of the filet or around the outer edge of the filet and secure with a toothpick.",
            "Add the filets to the air fryer basket, spray the tops with cooking spray and cook at 400 for 10-15 minutes, depending on the desired doneness. (See the notes section for temperature ranges.) You want to remove your steaks when they are 5 ºF BELOW the desired temperature.",
            "If adding cheese crumbles, top the filet with 0.5 oz. each of cheese crumbles (more if desired!) and cook for one additional minute to melt and soften.",
            "When done, remove the steaks from the air fryer and let rest for 5 minutes. During this time the center of the steak will continue to warm as they rest. Serve and enjoy!"
        ],
        "nutrition": {
            "calories": "Calories: 334kcal",
            "protein": "Protein: 44g",
            "carbohydrates": "N/A",
            "fat": "Fat: 18g",
            "SaturatedFat": "Fat: 18g",
            "Cholesterol": "Cholesterol: 124mg",
            "Sodium": "Sodium: 397mg",
            "Potassium": "Potassium: 519mg",
            "Sugar": "N/A"
        }
    },
    {
        "title": "Weeknight Cream of Mushroom Chicken Skillet",
        "url": "https://ohsnapmacros.com/cream-of-mushroom-chicken/",
        "ingredients": [
            "▢ 2 lbs. boneless skinless chicken breasts  raw",
            "▢ 1.5 tsp. salt",
            "▢ 1 tsp. chili powder",
            "▢ fresh cracked pepper",
            "▢ 1 Tbsp. olive oil",
            "▢ 8 oz. mushrooms sliced",
            "▢ 3 cloves  garlic minced",
            "▢ 1 can reduced-sodium cream of mushroom soup 10.5 oz can",
            "▢ 1 cup water",
            "▢ 1/2 Tbsp. cornstarch (or arrowroot powder) optional",
            "▢ 1/2-1 Tbsp. water (to mix) optional with cornstarch"
        ],
        "instructions": [
            "Slice all of the chicken breasts in half to butterfly into two pieces. Using a meat pounder, pound the chicken to create even cutlets, approximately ½ inch thick. Season with ½ the salt and chili powder on each side along with freshly cracked black pepper.",
            "Heat the olive oil in a large skillet over medium heat. Place the seasoned chicken in the pan and cook on each side for 4-5 minutes. Transfer to a plate and set aside.",
            "Add the sliced mushrooms and garlic to the pan. Cook, stirring, for a couple of minutes to brown the mushrooms.",
            "Add the cream of mushroom soup to the pan. Fill the can with water and add to the pan (1 cup of water). Using a whisk, whisk until the soup has combined with the water and no chunks remain and bring to a boil.",
            "Add the chicken back to the pan and simmer for 5 minutes or until the chicken is cooked through to an internal temperature of 165 degrees Fahrenheit.",
            "Optional: if you want a thicker sauce then in a small bowl, combine the cornstarch and water and mix to combine. Remove the chicken and set aside, add the slurry to the sauce and whisk to combine. Simmer for 1 minute to thicken (add more if you want it thicker). See notes.",
            "Either return the chicken to the pan and coat in the sauce or serce the chicken over brown or white rice, cauliflower rice, a combination of both, mashed potatoes or roasted veggies with sauce poured on top."
        ],
        "nutrition": {
            "calories": "Calories: 245kcal",
            "protein": "Protein: 36g",
            "carbohydrates": "Carbohydrates: 7g",
            "fat": "Fat: 7g",
            "SaturatedFat": "Fat: 7g",
            "Cholesterol": "Cholesterol: 111mg",
            "Sodium": "Sodium: 885mg",
            "Potassium": "Potassium: 844mg",
            "Sugar": "Sugar: 2g"
        }
    },
    {
        "title": "30 Minute One Pot Pumpkin Pasta with Cottage Cheese",
        "url": "https://ohsnapmacros.com/pumpkin-pasta/",
        "ingredients": [
            "▢ 1 Tbsp. olive oil",
            "▢ 1 cup yellow onion, chopped",
            "▢ 3 garlic cloves, minced",
            "▢ 1 lb. lean ground beef  96/4",
            "▢ 1 tsp. salt",
            "▢ 1/2-1/4 tsp. chipotle chili powder  see notes",
            "▢ 1/2 tsp. ground cumin",
            "▢ 1/4 tsp. dried rosemary",
            "▢ fresh cracked pepper",
            "▢ 16 oz. medium shell pasta",
            "▢ 4 cups low sodium beef broth  32 oz.",
            "▢ 1 cup water",
            "▢ 1 cup low-fat cottage cheese 220g",
            "▢ 1 can pumpkin puree 15 oz.",
            "▢ 1 tsp. cinnamon",
            "▢ 2 Tbsp. tomato paste",
            "▢ fresh rosemary",
            "▢ fresh basil",
            "▢ fresh sage leaves",
            "▢ Parmesan cheese"
        ],
        "instructions": [
            "Add the olive oil to a large skillet over medium heat. Add the onions and garlic and saute until the onion is translucent.",
            "Add the ground beef and cook, breaking into bite size pieces, until cooked through. Approximately 5 minutes. Add the salt, chipotle powder, cumin, rosemary and pepper. Stir to combine.",
            "Add the uncooked pasta, beef broth and water to the pan, stirring to submerge the pasta shells as best as possible. Bring to a boil and reduce to medium heat. Cook, stirring often for 12-14 minutes or until the pasta is cooked.",
            "Optional, add the cottage cheese, pumpkin puree, tomato paste and cinnamon to a blender and blend so the cottage cheese is smooth. Or, just add in chunky, I promise it doesn’t effect the taste or texture of the pasta.",
            "Add the cottage cheese, pumpkin puree, tomato paste and cinnamon directly to the pan with the pasta. Stir and cook for a few additional minutes to warm through and evenly coat the pasta shells.",
            "Adjust with salt and pepper to taste, serve and enjoy!"
        ],
        "nutrition": {
            "calories": "Calories: 459kcal",
            "protein": "Protein: 33g",
            "carbohydrates": "Carbohydrates: 67g",
            "fat": "Fat: 7g",
            "SaturatedFat": "Fat: 7g",
            "Cholesterol": "Cholesterol: 38mg",
            "Sodium": "Sodium: 490mg",
            "Potassium": "Potassium: 644mg",
            "Sugar": "Sugar: 7g"
        }
    },
    {
        "title": "Lazy Lasagna Skillet with Ground Beef (No Raviolis)",
        "url": "https://ohsnapmacros.com/lasagna-pasta-skillet/",
        "ingredients": [
            "▢ 1 lbs. lean ground beef  96/4",
            "▢ 1 small white onion, chopped  100g",
            "▢ 1 Tbsp. minced garlic",
            "▢ 1 tsp. salt",
            "▢ 1 tsp. black pepper",
            "▢ 1 Tbsp. Italian seasoning",
            "▢ 1/2 tsp. dried basil",
            "▢ 4 cups tomato basil pasta sauce  32oz. (I like Rao's)",
            "▢ 1/2 cup beef broth  low sodium",
            "▢ 8 oz. rigatoni noodles  measured uncooked",
            "▢ 4 oz. low moisture part skim mozzarella cheese shredded",
            "▢ 4 oz. part skim ricotta cheese",
            "▢ fresh chopped basil",
            "▢ parmesan cheese",
            "▢ additional ricotta cheese"
        ],
        "instructions": [
            "Bring a pot of water to a boil for cooking the pasta according to the directions on the box.",
            "While waiting on the water to boil, heat a large pan over medium heat and brown the ground beef while breaking into bite size pieces.",
            "When the meat is almost completely cooked through, stir in the chopped onion, garlic, salt, pepper, Italian seasoning and dried basil. Cook until fragrant and the onions are beginning to soften, approximately 3-5 minutes.",
            "Stir in the marinara sauce and beef broth and set to simmer while you cook the pasta noodles. Add the uncooked pasta to boiling water and boil according to the box instructions (about 13 minutes).",
            "Once pasta is cooked, drain and add to the pan with the meat sauce. Let simmer for 2-3 minutes while mixing the noodles in well to fully combine.",
            "Add the mozzarella and stir together until fully melted. While the lasagna is still hot add the ricotta cheese on top and slightly mix throughout the dish.",
            "Top with freshly chopped basil, parmesan cheese and enjoy."
        ],
        "nutrition": {
            "calories": "Calories: 422kcal",
            "protein": "Protein: 31g",
            "carbohydrates": "Carbohydrates: 39g",
            "fat": "Fat: 15g",
            "SaturatedFat": "Fat: 15g",
            "Cholesterol": "Cholesterol: 49mg",
            "Sodium": "Sodium: 244mg",
            "Potassium": "Potassium: 389mg",
            "Sugar": "Sugar: 1g"
        }
    },
    {
        "title": "Delicious Cottage Cheese Lasagna with Beef and Spinach",
        "url": "https://ohsnapmacros.com/cottage-cheese-lasagna/",
        "ingredients": [
            "▢ 1 Tbsp. olive oil",
            "▢ 4 cloves garlic roughly chopped",
            "▢ 1 small yellow onion chopped",
            "▢ 1 lb. lean ground beef 96/4",
            "▢ 1 tsp. oregano",
            "▢ 1 tsp. Italian seasoning",
            "▢ 1 tsp. paprika",
            "▢ 1/2 tsp. chili powder",
            "▢ 1 tsp. salt",
            "▢ 1/2 tsp. black pepper or fresh cracked to taste",
            "▢ 32 oz. jar of marinara sauce  (I use Raos)",
            "▢ 16 oz. low fat small curd cottage cheese Good Culture for best flavor",
            "▢ 2 eggs",
            "▢ 1/2 cup parmesan cheese shredded, 56g",
            "▢ 1/2 tsp. oregano",
            "▢ 1/2 tsp. Italian seasoning",
            "▢ 1/2 tsp. salt",
            "▢ fresh cracked pepper or pinch of black pepper",
            "▢ 10 oz. frozen spinach defrosted and strained",
            "▢ 8 oven ready lasagna noodles Barilla",
            "▢ 2 cups low moisture mozzarella cheese shredded, 224g"
        ],
        "instructions": [
            "Pre-heat the oven to 375 degrees Fahrenheit. Heat oil in a large skillet over medium heat. Add the garlic and onions to the pan and cook until nice and browned, approximately 3-5 minutes.",
            "Add the ground beef to the pan and break into bite size pieces. Cook until fully cooked through, mixing often, approximately 5 minutes.",
            "Add the oregano, italian seasoning, paprika, chili powder, salt and pepper to the beef mixture and combine to evenly coat.",
            "Add sauce, combine and simmer while you prepare the cottage cheese filling.",
            "For the filling: combine the cottage cheese, eggs, parmesan cheese, oregano, Italian seasoning, salt and pepper and mix well to combine. If your cottage cheese has excess liquid, strain some of it out! This helps keep your lasagna from being too liquidy.",
            "Add the defrosted and strained spinach to the cottage cheese mixture and mix to combine.",
            "Spray a 9×13 inch baking dish with non stick cooking spray. Add a dollop of the meat mixture to the bottom of the dish to lightly coat the bottom. Top with 4 noodles, the noodles are the width of the baking dish (short side) not the length.",
            "Top the noodles evenly with ½ cup mozzarella cheese (56g), followed by half the meat mixture. Use a spoon or spatula to evenly spread the mixture over the noodles. Top the meat mixture with half the cottage cheese filling and spread to coat the top. Repeat with 4 noodles, ½ cup cheese, remaining meat mixture, remaining cottage cheese filling and 1 cup cheese on top.",
            "Place the baking dish on a baking sheet to catch any overflow. Cover the dish with foil, try to avoid touching the cheese on top so that it doesn’t stick to the foil. Bake for 50 minutes.",
            "Remove the foil and bake an additional 10-15 minutes until the cheese is melted and browned and the sauce is nice and bubbly at the edges.",
            "Top with freshly chopped parsley and cut into 12 equal servings and enjoy this easy lasagna recipe."
        ],
        "nutrition": {
            "calories": "Calories: 277kcal",
            "protein": "Protein: 22g",
            "carbohydrates": "Carbohydrates: 15g",
            "fat": "Fat: 14g",
            "SaturatedFat": "Fat: 14g",
            "Cholesterol": "Cholesterol: 75mg",
            "Sodium": "Sodium: 849mg",
            "Potassium": "Potassium: 183mg",
            "Sugar": "Sugar: 4g"
        }
    },
    {
        "title": "Big Mac Casserole",
        "url": "https://ohsnapmacros.com/big-mac-casserole/",
        "ingredients": [
            "▢ 1 lbs. lean ground beef  96/4",
            "▢ 1 lbs. russet potatoes chopped",
            "▢ 1/2 white onion chopped",
            "▢ 1/4 cup water",
            "▢ 1 tsp. olive oil",
            "▢ 2 tsp. yellow mustard",
            "▢ 1/2 tsp. garlic powder",
            "▢ 1/2 tsp. onion powder",
            "▢ 1 cup  shredded cheddar cheese 112g",
            "▢ 1/4 cup mayonnaise  55g",
            "▢ 1/4 cup ketchup 65g",
            "▢ 1/4 cup dill pickles chopped",
            "▢ 1 tbsp. dill pickle juice",
            "▢ 1 vine tomato chopped",
            "▢ handful white onions chopped",
            "▢ handful shredded iceberg lettuce",
            "▢ 1/4 cup dill pickle chips"
        ],
        "instructions": [
            "Preheat the oven to 375 degrees Fahrenheit. Wash and chop your potatoes, leaving the skin on, into small bite size pieces. The smaller the better.",
            "Heat a pan over medium heat on the stove and add the olive oil to the pan. Add potatoes to the hot oil and 1/4 cup of water. Season the potatoes generously with salt and pepper and cook until they begin to soften, stirring often so you do not burn the bottoms. This could take anywhere from 5 to 10 minutes depending on the size of your potato chunks. Once the potatoes have softened, place them in the baking dish.",
            "In the same pan you cooked the potatoes, add the ground beef and onions. Cook until the ground beef is mostly cooked through and the onions have softened. Season with salt, pepper, garlic powder, onion powder and mustard. Stir to combine well. Add the cooked beef mixture to the potatoes in the baking dish and mix together.",
            "Top the potato and beef mixture with shredded cheddar cheese and cover with foil. Place in the oven for 15 minutes until the cheese has melted.",
            "While the casserole bakes make you big mac sauce. Combine mayonnaise, ketchup, chopped pickles and pickle juice and stir to combine. Place in the fridge until ready to add to your casserole.",
            "When the casserole is done baking, remove from the oven and remove the foil. Top with the big mac sauce drizzled across the top (use it all!), shredded lettuce, chopped white onion, chopped tomatoes and full pickle chips. Serve and enjoy!"
        ],
        "nutrition": {
            "calories": "Calories: 319kcal",
            "protein": "Protein: 23g",
            "carbohydrates": "Carbohydrates: 19g",
            "fat": "Fat: 17g",
            "SaturatedFat": "Fat: 17g",
            "Cholesterol": "Cholesterol: 60mg",
            "Sodium": "Sodium: 429mg",
            "Potassium": "Potassium: 375mg",
            "Sugar": "Sugar: 3g"
        }
    }
]